### Terraform Plan: `staging`

<details><summary>Show plan</summary>

```
data.terraform_remote_state.shared: Reading...
module.env.random_password.db_password: Refreshing state... [id=none]
module.env.google_service_account.keycache_server: Refreshing state... [id=projects/pocket-av/serviceAccounts/keycache-server-staging@pocket-av.iam.gserviceaccount.com]
module.env.google_compute_global_address.web_ipv4: Refreshing state... [id=projects/pocket-av/global/addresses/pocket-av-web-ip-staging]
module.env.google_vpc_access_connector.connector: Refreshing state... [id=projects/pocket-av/locations/us-central1/connectors/run-connector-staging]
module.env.google_secret_manager_secret.db_password: Refreshing state... [id=projects/pocket-av/secrets/db-password-staging]
module.env.google_compute_url_map.web_http_redirect: Refreshing state... [id=projects/pocket-av/global/urlMaps/pocket-av-web-http-redirect-staging]
data.terraform_remote_state.shared: Read complete after 1s
module.env.google_compute_managed_ssl_certificate.web: Refreshing state... [id=projects/pocket-av/global/sslCertificates/pocket-av-web-cert-staging]
module.env.google_storage_bucket.web: Refreshing state... [id=staging.pocket-rad.io]
module.env.google_sql_database_instance.main: Refreshing state... [id=pocket-av-db-staging]
module.env.google_secret_manager_secret_version.db_password: Refreshing state... [id=projects/148242134126/secrets/db-password-staging/versions/1]
module.env.google_storage_bucket_iam_member.web_public: Refreshing state... [id=b/staging.pocket-rad.io/roles/storage.objectViewer/allUsers]
module.env.google_storage_bucket_iam_member.web_deployer: Refreshing state... [id=b/staging.pocket-rad.io/roles/storage.objectAdmin/serviceAccount:github-actions@pocket-av.iam.gserviceaccount.com]
module.env.google_compute_backend_bucket.web: Refreshing state... [id=projects/pocket-av/global/backendBuckets/pocket-av-web-backend-staging]
module.env.google_compute_target_http_proxy.web: Refreshing state... [id=projects/pocket-av/global/targetHttpProxies/pocket-av-web-http-staging]
module.env.google_project_iam_member.keycache_server_roles["roles/cloudsql.client"]: Refreshing state... [id=pocket-av/roles/cloudsql.client/serviceAccount:keycache-server-staging@pocket-av.iam.gserviceaccount.com]
module.env.google_project_iam_member.keycache_server_roles["roles/secretmanager.secretAccessor"]: Refreshing state... [id=pocket-av/roles/secretmanager.secretAccessor/serviceAccount:keycache-server-staging@pocket-av.iam.gserviceaccount.com]
module.env.google_sql_user.app: Refreshing state... [id=ssdb//pocket-av-db-staging]
module.env.google_sql_database.keycache: Refreshing state... [id=projects/pocket-av/instances/pocket-av-db-staging/databases/keycache]
module.env.google_dns_record_set.web_a: Refreshing state... [id=projects/pocket-av/managedZones/pocket-rad-io/rrsets/staging.pocket-rad.io./A]
module.env.google_compute_url_map.web: Refreshing state... [id=projects/pocket-av/global/urlMaps/pocket-av-web-staging]
module.env.google_cloud_run_v2_service.keycache_server: Refreshing state... [id=projects/pocket-av/locations/us-central1/services/keycache-server-staging]
module.env.google_compute_global_forwarding_rule.web_http: Refreshing state... [id=projects/pocket-av/global/forwardingRules/pocket-av-web-http-fwd-staging]
module.env.google_compute_target_https_proxy.web: Refreshing state... [id=projects/pocket-av/global/targetHttpsProxies/pocket-av-web-https-staging]
module.env.google_compute_global_forwarding_rule.web_https: Refreshing state... [id=projects/pocket-av/global/forwardingRules/pocket-av-web-https-fwd-staging]
module.env.google_cloud_run_v2_service_iam_member.public: Refreshing state... [id=projects/pocket-av/locations/us-central1/services/keycache-server-staging/roles/run.invoker/allUsers]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.env.google_cloud_run_v2_service.keycache_server will be updated in-place
  ~ resource "google_cloud_run_v2_service" "keycache_server" {
      - client                  = "gcloud" -> null
      - client_version          = "554.0.0" -> null
        id                      = "projects/pocket-av/locations/us-central1/services/keycache-server-staging"
        name                    = "keycache-server-staging"
        # (31 unchanged attributes hidden)

      ~ template {
            # (10 unchanged attributes hidden)

          ~ containers {
                name           = null
                # (7 unchanged attributes hidden)

              + env {
                  + name  = "RECORDINGS_BUCKET"
                  + value = "pocket-av-recordings-staging"
                }

                # (7 unchanged blocks hidden)
            }

            # (2 unchanged blocks hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.env.google_storage_bucket.recordings will be created
  + resource "google_storage_bucket" "recordings" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "US-CENTRAL1"
      + name                        = "pocket-av-recordings-staging"
      + project                     = "pocket-av"
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.env.google_storage_bucket_iam_member.recordings_admin will be created
  + resource "google_storage_bucket_iam_member" "recordings_admin" {
      + bucket = "pocket-av-recordings-staging"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:keycache-server-staging@pocket-av.iam.gserviceaccount.com"
      + role   = "roles/storage.objectAdmin"
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>